---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ModelArc
source: html/72d482b1-f72b-0a37-7934-b29c4b01aa3a.htm
---
# ModelArc Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.